use mermaid for flow diagrams in docs
